'use client';

import { useCurrentScope } from '@/hooks';
import { CaretLeft } from '@phosphor-icons/react/dist/ssr';
import NewsComments from './NewsComments';
import NewsList from './NewsList';

export default function News({ params }: PageProps<'scopeId' | 'id'>) {
  const scope = useCurrentScope();

  return (
    <div className="max-w-7xl mx-auto">
      {/* news path */}
      <div className="flex gap-1 items-center text-gray-500 my-4">
        <span>حوزه های x</span> <CaretLeft /> <span>اخبار</span> <CaretLeft />{' '}
        <span className="text-black">
          عنوان خبر که می‌تواند به اندازه خوبی طولانی باشد عنوان خبر که می‌تواند به اندازه خوبی طولانی باشد
        </span>
      </div>
      <div className="bg-gray-100 text-black flex gap-8">
        <main className="flex flex-col w-3/4 mb-10 ">
          <img src="/newsPoster.png" className="w-full rounded-md" />

          {/* نویسنده خبر */}
          <div className="w-full flex justify-between mt-6">
            <h5>نویسنده خبر</h5>
            <span>12:34:54 - 1403/11/01</span>
          </div>

          {/* جزئیات خبر */}
          <div className="mt-8">
            <h1 className="text-4xl font-bold mb-8">
              عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد
            </h1>

            <p className="mt-3">
              یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از
              محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر
              نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن
              برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود
              را مطرح کرده است.
            </p>
            <p className="mt-3">
              یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از
              محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر
              نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن
              برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود
              را مطرح کرده است.
            </p>
            <p className="mt-3">
              یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از
              محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر
              نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن
              برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود
              را مطرح کرده است.
            </p>
            <p className="mt-3">
              یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از
              محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر
              نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن
              برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود
              را مطرح کرده است.
            </p>
            <p className="mt-3">
              یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از
              محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر
              نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن
              برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود
              را مطرح کرده است.
            </p>
            <p className="mt-3">
              یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از
              محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر
              نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن
              برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود
              را مطرح کرده است.
            </p>
          </div>

          {/* دیدگاه من */}
          <div className="p-6 rounded-lg bg-white mt-10 flex flex-col">
            <h5 className="font-bold text-xl">دیدگاه من:</h5>
            <textarea
              placeholder="نوشتن دیدگاه"
              className="rounded-lg w-full min-h-32 mt-6 bg-gray-100 resize-none p-4"
            ></textarea>
            <button className="btn btn-primary w-52 text-white mt-6 left-0 self-end">ثبت دیدگاه</button>
          </div>

          {/* comments */}
          <NewsComments
            items={[
              {
                userName: 'علی',
                userImg: '/userImage.png',
                date: '1402/11/21',
                time: '11:26',
                content:
                  'یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.',
                likes: 47,
              },
              {
                userName: 'علی',
                userImg: '/userImage.png',
                date: '1402/11/21',
                time: '11:26',
                content:
                  'یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.یک پاراگراف از محتوایی که کاربر نوشته است و در آن برای مثال سوال خود را مطرح کرده است.',
                likes: 47,
              },
            ]}
          />
        </main>

        {/* بخش کناری که اخبار منتخب رو به صورت لیستی نشون میده */}
        <aside className="flex flex-col gap-4 flex-5 w-1/4">
          <NewsList
            title="اخبار منتخب"
            items={[
              {
                image: '/singleNewsCover.png',
                title:
                  'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشد. عنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
              },
              {
                image: '/singleNewsCover.png',
                title: 'hiiii',
              },
              {
                image: '/singleNewsCover.png',
                title: 'hiiii',
              },
            ]}
          />

          <NewsList
            title="انتخاب سردبیر"
            items={[
              {
                image: '/singleNewsCover.png',
                title: 'hiiii',
              },
            ]}
          />
        </aside>
      </div>
    </div>
  );
}
