import { newsSingleCard } from 'src/types/news';

export function mockNews(): newsSingleCard[] {
  return [
    {
      id: 1,
      title: 'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
      author: 'نویسنده خبر',
      coverImage: '/newsPoster.png',
      createAt: '1402/11/01 12:34:50',
    },
    {
      id: 2,
      title: 'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
      author: 'نویسنده خبر',
      coverImage: '/newsPoster.png',
      createAt: '1402/11/01 12:34:50',
    },
    {
      id: 3,
      title: 'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
      author: 'نویسنده خبر',
      coverImage: '/newsPoster.png',
      createAt: '1402/11/01 12:34:50',
    },
    {
      id: 4,
      title: 'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
      author: 'نویسنده خبر',
      coverImage: '/newsPoster.png',
      createAt: '1402/11/01 12:34:50',
    },
    {
      id: 5,
      title: 'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
      author: 'نویسنده خبر',
      coverImage: '/newsPoster.png',
      createAt: '1402/11/01 12:34:50',
    },
    {
      id: 6,
      title: 'عنوان خبر که می‌تواند به اندازه خوبی طولانی باشدعنوان خبر که می‌تواند به اندازه خوبی طولانی باشد',
      author: 'نویسنده خبر',
      coverImage: '/newsPoster.png',
      createAt: '1402/11/01 12:34:50',
    },
  ];
}
